Revit 2027 API
ParameterTypeId.RbsPipeSegmentParam Property
 "Pipe Segment"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsPipeSegmentParam { get; }
Public Shared ReadOnly Property RbsPipeSegmentParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsPipeSegmentParam {
	ForgeTypeId^ get ();
}
static member RbsPipeSegmentParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace